sQueezy1332/esp32_proxima_pir_tgbot/main.cpp
#include "esp32_pir_tg_bot.h"
/*		INIT	*/
extern "C" void app_main() {
	main_init();//nvs_func();
	dWrite(PIN_LINE, 1);pinMode(PIN_LINE, PULLUP | OUTPUT_OPEN_DRAIN);//dWrite(PIN_PULLUP, 1); pinMode(PIN_PULLUP, OUTPUT); 
	AutoLed<PIN_LED> led; pinMode(PIN_LED,OUTPUT);
	QueueMsgHandle = xQueueCreateStatic(QUEUE_LEN, QUEUE_ITEM_SIZE, QueueMsgStorage, &xStaticQueue);
	nvs_read_sets();
	//read_credentials();
	init_sets();
	sets.alarm ? alarm_on(false) : alarm_off(false);
	SPIFFS.begin();
#ifndef FIRST_BUILD
	assert(timer_pwr = esp_timer_init([](void* ) { dWrite(PIN_PWR_BUTTON, 1); } )); 
	pinMode(PIN_LED_D5, PULLUP | OUTPUT); pinMode(PIN_BUTTON, INPUT);//pinMode(PIN_RELAY, OUTPUT);
	dWrite(PIN_PWR_BUTTON, 1); pinMode(PIN_PWR_BUTTON, OUTPUT_OPEN_DRAIN);
#ifdef RELAY
	dWrite(PIN_RELAY, RELAY_STATE(sets.relay)); pinMode(PIN_RELAY, OUTPUT);
#endif
	WiFi.mode(WIFI_MODE_STA);
#else
	wifi_ap_init();
#endif
	wifi_server_init();
	if (!wifi_sta_init()) {  /* WiFi.begin(DEFAULT_SSID, DEFAULT_PASS,0, NULL);  */};
	configTzTime("MSK-3", "pool.ntp.org", "time.nist.gov"); 
	//sntp_set_time_sync_notification_cb(); //time_sync();//setenv("TZ", "MSK-3", 1); tzset();
	bot.attachUpdate(updateHandler);
	bot.skipNextMessage();
	bot.setPollMode(fb::Poll::Long, 30000);
	botSend.client.setHandshakeTimeout(10); bot.client.setHandshakeTimeout(15);
	//vTaskPrioritySet(NULL, 12);
	loopTaskHandle = xTaskCreateStatic(mainTask, "main", sizeof(xMainStack), NULL, 9, xMainStack, &xMainTaskBuffer);
	vTaskSuspend(loopTaskHandle);
	sendTaskHandle = xTaskCreateStatic(sendTask, "send", sizeof(xSendStack), NULL, 11, xSendStack, &xSendTaskBuffer);
	ESP_LOGI(TAG, "StackHighWaterMark: %u", uxTaskGetStackHighWaterMark2(NULL));
	vTaskResume(loopTaskHandle); /* vTaskResume(sendTaskHandle); */
}

void mainTask(void*) {
	for (TickType_t lastTry = 0;;) {
		switch (Flag) {
		case RESEND_MSG: 
		if (xTaskGetTickCount() - lastTry > pdMS_TO_TICKS(15 * 60 * 1000)) {
			if(send_alarm_time()) { Flag = CHECK_MSG; }
			lastTry = xTaskGetTickCount(); log_i("%u", Flag);
		}
		case CHECK_MSG: { 
			AutoLed <PIN_LED_D5> led;
			if (wifi_sta_init()) { 
				delay(10); 
				if(bot.tick()) {

				};
			} 
		}
			delay(FB_LONG_POLL_TOUT - 10);continue;
		case WIFI_DISCONNECT: {
			//if (esp_netif_sntp_sync_wait(pdMS_TO_TICKS(5000)) != ESP_OK) {ESP_LOGI(TAG, "Update system time timeout");}
			__unused time_t now = time(NULL); ESP_LOGI(TAG, "%lu", now);
			WiFi.disconnect();
			}
			ulTaskNotifyTake(pdFALSE, pdMS_TO_TICKS(60 * 60 * 1000));
		case WIFI_RECON: 
			if (wifi_sta_init()) { bot.tickManual(); } continue;
		case WIFI_INIT: WiFi.begin(Auth->ssid, Auth->pass);
			delete Auth; Auth = nullptr;
			Flag = CHECK_MSG; continue;
		case RESTART: bot.tickManual(); esp_restart(); return;
		default: vTaskDelay(1);  ESP_LOGI("main",""); Flag = CHECK_MSG;
		}
	}
}

void sendTask(void*) {
	Message msg(get_info(true), CHAT_ID); tgMsg_t event; TickType_t tick = 0;
	botSend.sendMessage(std::move(msg));
	send_alarm_time(std::move(msg), botSend, false);
	for (;;) {
		if (xQueueReceive(QueueMsgHandle, &event, portMAX_DELAY) == pdPASS) {
			AutoLed<PIN_LED> led; 
			if (wifi_sta_init()) {
				switch (event.status) {
				case ALARM: msg.text = "ALARM"; break;
				case GERKON_CLOSE: msg.text = "GERKON_CLOSE";  break;
				case GERKON_OPEN: msg.text = "GERKON_OPEN";  break;
				case LINE_LOW:  msg.text = "LINE_LOW";  break;
				case LINE_HIGH: msg.text = "LINE_HIGH"; break;
				case RELAY_0: msg.text = "RELAY_OFF"; break;
				case RELAY_1: msg.text = "RELAY_ON"; break;
				case RESEND_MSG: send_alarm_time(std::move(msg)); return;
				case ok: msg.text = "OK";
					if(event.counter) { CHECK_(timer_alarm(timer_sab, TIMER_SABOTAGE)); }
					break; //goto _OK;
				default: msg.text = "0x"; msg.text += String(event.status, HEX); break;
				}
				msg.text.concat('\t'); msg.text.concat(event.delta);
				//_OK: //if (event.counter > 1) { msg.text.concat("\t%\t"); msg.text.concat(event.counter); }
				vTaskDelayUntil(&tick, pdMS_TO_TICKS(1000)); tick = xTaskGetTickCount();
				ESP_LOGI("sendTask()","%s", msg.text.c_str()); //if(!dRead(PIN_BUTTON)) goto save;
				if (botSend.sendMessage(msg)) {
					if(Flag > CHECK_MSG) resumeTask(); log_v(""); 
					continue;
				}
				else {
					log_w("try again"); delay(2000);
					if (botSend.sendMessage(msg)) { tick = xTaskGetTickCount(); continue; }
				} log_d("%u", ESP.getFreeHeap());
			}
			else if (!event_id) event_id = WiFi.onEvent(onWiFiConnected);
save:		if (event.status != ok) { log_i("save");
				appendFile(ALARM_PATH, time(NULL));
				if(Flag != RESEND_MSG) resumeTask(RESEND_MSG); 
			}
		}//vTaskGetInfo();
	}
}

void adcReadTask(void*) { 
	const adc_digi_output_data_t *p; tgMsg_t out {};
	uint32_t ret_num, val, i, last_sw = 0; curr_adc_ptr = &val;
	for(;;) {
        ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
        //TickType_t now =  xTaskGetTickCount(); ESP_LOGD("TIME", "%lu", pdTICKS_TO_MS(now - last)); last = now;
            esp_err_t ret = adc_continuous_read(adc_handle, adc_buf, BUF_ADC_SIZE, &ret_num, 0);
            if (ret == ESP_OK)  {
                //ESP_LOGW("TASK", "ret = %x, ret_num = %"PRIu32" bytes", ret, ret_num);
                ret_num /= SOC_ADC_DIGI_RESULT_BYTES;
                for (i = 0, val = 0; i < ret_num; i++) { 
                    p = &reinterpret_cast<decltype(p)>(adc_buf)[i];// __unused uint32_t chan_num = EXAMPLE_ADC_GET_CHANNEL(p);
                    val += ADC_GET_DATA(p);
                }
                val /= ret_num;
				//uint32_t volt = val * 3300 / 4095; 
				ESP_LOGV("adc", "Value: %u", val);
			if(1) {
				if(val > gerkon_open_high) { 
					if(out.status == LINE_HIGH) continue; 
					out.status = LINE_HIGH;
				}
				else if(val > gerkon_close_high) { 
					if(!sets.alarm || (out.status == GERKON_OPEN)) continue; 
					out.status = GERKON_OPEN; 
				} 
				else if(val > gerkon_close_low ) { 
					if(!sets.alarm || (out.status == GERKON_CLOSE)) continue;  
					out.status = GERKON_CLOSE; 
				} 
				else if(val > gerkon_button_low) { //TODO
					//if(++out.counter == ADC_TASK_FREQ);
					TickType_t now = xTaskGetTickCount();
					if(now - last_sw > pdMS_TO_TICKS(DEF_SWITCH_DELAY)) {
						last_sw = now;
						const int new_state = !dRead(PIN_RELAY); sets.relay = RELAY_STATE(new_state);
						dWrite(PIN_RELAY, new_state);
						if(!sets.alarm) continue;
						out.status = RELAY_STATE(new_state) ? RELAY_1 : RELAY_0; 
					} else continue;
				}
				else { 
					if(out.status == LINE_LOW) continue; 
					else out.status = LINE_LOW; 
				} //val < adc_button_low
				out.delta = val; //out.counter = 0;
				xQueueSend(QueueMsgHandle, &out, 0);
			}	
            }
            else if (ret == ESP_ERR_TIMEOUT) { /* ESP_LOGW("ERR", "TIMEOUT"); */ }
            else { ESP_LOGW("ERR", "err = 0x%02X", ret); }
	
    } //ESP_ERROR_CHECK(adc_continuous_stop(adc_handle)); ESP_ERROR_CHECK(adc_continuous_deinit(adc_handle));
}

/* void time_sync(byte wait_sec) {
	DEBUG("Time sync "); if (!WiFi.isConnected()) return;
	time_t temp = 0;
	for (;; --wait_sec) {
		time(&temp);
		if (temp > 0x40000000) break;
		if (wait_sec == 0) {
			DEBUGLN(" failed!"); return;
		}
		delay(1000); DEBUG('*');
	}
	time_sync_unix = uS; DEBUGLN(" success");
	timestamp_unix = temp;
	log_i("%u , timer %u", temp, wait_sec);
} */
/*		INTERRUPTS		*/
static void isr_handler(/*void**/) {
	if (lineRead) return;
	uint64_t time = uS;
	timer_restart_impl();
	tgMsg_t tmp; uint32_t delta = time - last_interrupt; 
	last_interrupt = time; //interrupt_delta = delta; 
	if (delta < 2400000 /*&& delta > 10000*/) {
		if (delta < 10000) { disableInterrupt(PIN_LINE); esp_timer_start_once(timer_intr, 1000 * 300); } 
		tmp.status = ALARM; tmp.delta = (uint16_t)(delta / 1000);
	}
	else if (last_state == ok) return;
	else { tmp.status = ok; tmp.counter = (last_state > LINE_LOW) ? 1 : 0;
	} //isr_log_d("%u", tmp.status);
	last_state = tmp.status; 
	xQueueSendFromISR(QueueMsgHandle, &tmp, NULL);//sizeof(tgMsg_t)
}

static bool sabotage_timer(gptimer_handle_t tmr, const gptimer_alarm_event_data_t* edata, void* user_ctx) {
	uint32_t delta = edata->count_value / 1000;
	tgMsg_t tmp {
		.status = lineRead ? LINE_HIGH : LINE_LOW,
		.delta = (uint16_t)(delta > __UINT16_MAX__ ? __UINT16_MAX__ : delta)
	};
	last_state = tmp.status;
	xQueueSendFromISR(QueueMsgHandle, &tmp, nullptr);
	return false;
}

/*		FILE SYSTEM	*/

bool send_alarm_time(Message&& msg, FastBot2& _bot, bool no_file) {
	ESP_LOGI(TAG, "Reading file: %s", ALARM_PATH); //sizeof(Message);108
	String& str = msg.text; File file = SPIFFS.open(ALARM_PATH, FILE_READ);
	if (!file || file.isDirectory() || !file.available()) {
		DEBUGLN(" failed to open file for reading");
		if (no_file) { str = "No file"; _bot.sendMessage(msg); }
		return true;
	}
	const uint32_t file_size = file.size(), count = file_size / sizeof(time_t), str_len = 18 * count, heap = ESP.getFreeHeap();
	__unused char* ptr; size_t offset; time_t timestamp = 0; __unused int tm_yday_last = 0;
	log_i("file_size %u, count %u, str_len %u, HEAP %u", file_size, count, str_len, heap);
	if (!str.reserve(str_len) /*|| heap - 5000 < str_len*/) {
		str = "file_size "; str += file_size; str += "\ncount ";
		str += count; str += "\nstr_len "; str += str_len; str += "\nHEAP "; str += heap;
		goto try_send;
	} ptr = str.begin();
	static const char fmt1[] = "%H:%M:%S", fmt2[] = " %d.%m.%y";
	for (offset = 0; offset < str_len && file.available();) {
		file.read((byte*)&timestamp, sizeof(time_t)); DEBUG(timestamp); DEBUG(' ');//"%H:%M:%S %d.%m.%y"
		tm* timeinfo = localtime(&timestamp);  //localtime_r() do same
		strftime(&ptr[offset], sizeof(fmt1), fmt1, timeinfo);
		offset += sizeof(fmt1)-1;
		if (timeinfo->tm_yday != tm_yday_last) {
			strftime(&ptr[offset], sizeof(fmt2), fmt2, timeinfo);
			offset += sizeof(fmt2)-1;
			tm_yday_last = timeinfo->tm_yday;
		}
		ptr[offset++] = '\n'; //free(timeinfo);
		 	//str += (uint32_t)timestamp; str += "\n";
	}DEBUGLN(); //log_d("%u", ESP.getFreeHeap());
	ptr[offset - 1] = '\0';
	reinterpret_cast<uint32_t*>(&str)[2] = offset; //incapsulation hack //_ptr.len
try_send: DEBUGLN(str);
	if (wifi_sta_init()) {
		if (_bot.sendMessage(msg)) {
			if (event_id) { WiFi.removeEvent(event_id); event_id = 0; }
		}
		return true;
	}
	else if (!event_id) event_id = WiFi.onEvent(onWiFiConnected, ARDUINO_EVENT_WIFI_STA_CONNECTED);
	return false;

