sQueezy1332/esp32_proxima_pir_tgbot/main.cpp
}

bool readFile(cch* path, String& Content) {
	DEBUG("Reading file: "); DEBUGLN(path);
	fs::File file = SPIFFS.open(path, FILE_READ);
	if (!file || file.isDirectory() || !file.available()) {
		DEBUGLN(" failed to open file for reading");
		return false;
	}
	Content = file.readStringUntil('\0');
	return true;
}

bool writeFile(cch* path, const String& Content) {
	DEBUG("Writing file: "); DEBUG(path);
	fs::File file = SPIFFS.open(path, FILE_WRITE);
	if (!file) { DEBUGLN(" failed to open file for writing"); }
	else if (file.print(Content)) {
		DEBUGLN(" written");
		return true;
	}
	else {DEBUGLN(" write failed");}
	return false;
}

bool appendFile(cch* path, time_t value) {
	DEBUG("Append file: "); DEBUG(path);
	fs::File file = SPIFFS.open(path, FILE_APPEND);
	if (!file) { DEBUGLN(" failed to open file for writing"); }
	else if (file.write((byte*)&value, sizeof(time_t))) {
		DEBUGLN(" written");
		return true;
	}
	else {DEBUGLN(" write failed");}
	return false;
}

bool deleteFile(cch* path) {
	DEBUG("Deleting file: "); DEBUG(path);
	if (!SPIFFS.remove(path)) {
		DEBUGLN(" delete failed");
		return false;
	}
	DEBUGLN(" deleted");
	return true;
}
/*		WIFI	*/
bool wifi_sta_init(uint32_t timer) {//WiFi.begin()
	if (WiFi.isConnected() == false) {
		if (!WiFi.STA.begin(true)) return false;
		wl_status_t status;  ESP_LOGI(TAG, "Wait connection %u ms", STA_INIT_DELAY * timer);
		for (; (status = WiFi.status()) != WL_CONNECTED; timer--) {
			if (timer == 0) { ESP_LOGW(TAG, "Not connected"); return false; }
			delay(STA_INIT_DELAY); DEBUG(status); DEBUG(' ');
		} ESP_LOGI(TAG, "status: %u timer: %u", status, timer);
	}
	return true;
}

void wifi_ap_init() {
	WiFi.mode(WIFI_MODE_APSTA);
#if	AP_WIFI_CHANNEL > 11
	CHECK_(esp_wifi_set_country_code("CN", false));
#endif
	WiFi.softAP(AP_SSID, AP_PASS, AP_WIFI_CHANNEL, SSID_HIDDEN);
	WiFi.setTxPower(WIFI_POWER_20dBm); DEBUGLN(WiFi.getTxPower()); //WIFI_POWER_20dBm = 80,// 20dBm
	WiFi.softAPbandwidth(WIFI_BW_HT20);
	DEBUGLN("\nAP running"); DEBUGLN(AP_SSID); DEBUGLN(AP_PASS); DEBUG("My IP address: "); DEBUGLN(WiFi.softAPIP());DEBUGLN();
}

void onWiFiConnected(arduino_event_id_t event) {
	if (event == ARDUINO_EVENT_WIFI_STA_GOT_IP) {
		WiFi.removeEvent(event_id); event_id = 0;
		resumeTask(RESEND_MSG);
	}
	ESP_LOGI(TAG, "arduino_event_id: %u", event);
}

void onConfigRequest(AsyncWebServerRequest* request) {
	auto pSSID = request->getParam(0), pPASS = request->getParam(1);
	bool wrongSSID = pSSID->value().length() == 0, wrongPASS = pPASS->value().length() < 8;
	if (wrongSSID || wrongPASS) {
		request->send(200, "text/plain", "WRONG INPUT"); return;
	}
	delete Auth;
	Auth = new auth_t{
		.ssid = pSSID->value(),
		.pass = pPASS->value()
	};//sizeof(auth_t)
	String log; log.reserve(128);
	//DEBUGF("POST[%s]: %s\n", pSSID->name().c_str(), pSSID->value().c_str(), pPASS->name().c_str(), pPASS->value().c_str());
	log += "SSID = ["; log += Auth->ssid; log += "]\n"; log += "PASS = ["; log += Auth->pass; log += "]\n";
	log += "Done. Go to ""/connect"; DEBUGLN(log);
	request->send(200, "text/plain", log);
	//resumeTask(WIFI_INIT);
}
/*		TELEGRAM	*/
void handleMessage(fb::Update& u) {
	Message msg("",u.message().chat().id()); DEBUGLN(u.message().text());
	switch (u.message().text().hash()) {
	case SH("/connect"):
		Flag = CHECK_MSG; msg.text = "Stay connected"; break;
	case SH("/disconnect"):
		Flag = WIFI_DISCONNECT; msg.text = "Disconnecting..."; break;
	case SH("/alarm"):
		alarm_on(); msg.text = "Alarm on"; break;
	case SH("/alarm0"):
		alarm_off(); msg.text = "Alarm off"; break;	
	case SH("/info"):
		msg.text = std::move(get_info()); break;
	case SH("/adc"):
		msg.text = "ADC value = "; msg.text += *curr_adc_ptr; break;
	case SH("/task_list"):
		get_task_list(msg.text); break;
	case SH("/restart"): //esp_restart();
		bot.reboot(); Flag = RESTART; msg.text = "Restarting..."; break;
	case SH("/time_sync"): {
		timeval val {.tv_sec = time(NULL)};
		settimeofday(&val, NULL);
	 	msg.text = "Unix time = "; msg.text += val.tv_sec;
	}break;
	case SH("/time_sync_tg"): {
		timeval val {.tv_sec = u[tg_apih::date]};
		settimeofday(&val, NULL);
	 	msg.text = "Unix time = "; msg.text += val.tv_sec;
	}
	case SH("/send_alarm"): 
		{stat_t t = RESEND_MSG;xQueueSend(QueueMsgHandle, &t, 0);} break;
		//send_alarm_time(std::move(msg), bot); return;
	case SH("/clear_alarm"):
		msg.text = deleteFile(ALARM_PATH) ? "Done" : "No file"; break;
	case SH("/valid"):
		msg.text = (int)img_state(true); break;
	case SH("/invalid"): esp_ota_mark_app_invalid_rollback_and_reboot(); return;
	/* case SH("/pir_reset"):
		 pir_reset(); msg.text = "Done"; break; */
	case SH("/bot_kill"): {memset((void*)&bot, 0, sizeof(botSend)); } break;
	//case SH("/die"): Flag = PANIC; msg.text = "/die"; break;
		//case SH("/ota_invalidate"):
		//msg.text = (int)esp_ota_invalidate_inactive_ota_data_slot(); break;
		//case SH("/timer_count"): {uint64_t count = 0; gptimer_get_raw_count(timer_sab, &count);msg.text = String(count /= 1000); } break;
		//case SH("/nvs_erase"): nvs_wifi_erase(); break;
#if defined RELAY
	case SH(RELAY_ON): {
		const int new_state = !dRead(PIN_RELAY); sets.relay = RELAY_STATE(new_state);
		dWrite(PIN_RELAY, new_state); msg.text = "RELAY "; 
		msg.text += RELAY_STATE(new_state) ? '1' : '0';
	} break;
#endif
#ifndef FIRST_BUILD
	case SH("/pwr"):
	if(!esp_timer_start_once(timer_pwr, 100 * 1000))
	{ dWrite(PIN_PWR_BUTTON, 0); msg.text = "pwr_btn"; } break;
	case SH("/pwr_push"):
	if(!esp_timer_start_once(timer_pwr, 10 * 1000 * 1000))
	{ dWrite(PIN_PWR_BUTTON, 0); msg.text = "pwr_btn"; msg.text += " push"; } break;
	case SH("/pwr_up"):
		dWrite(PIN_PWR_BUTTON, 1); msg.text = "pwr_btn"; msg.text += " release"; break;
#endif
#ifndef NO_BLE
	case SH("/ble_clear"):
		free(ble_data); ble_data = nullptr; ble_data_size = 0;
		msg.text = "Done"; break;
	case SH("/ble_deinit"): break;
	case SH("/ble"): {
		auto && ret = ble_advertising(ble_data, ble_data_size);
		if (ret == ESP_OK) msg.text = "BLE data sended";
		else if (ret == -1)  msg.text = "BLE data empty";
		else msg.text = String(ret, HEX);
	} break;
	default: {
		/* if (u.message().text().startsWith(BLE_SET)) {
			if (strtoB(u.message().text(), ble_data, ble_data_size, sizeof(BLE_SET))) {
				create_hex_string(msg.text, ble_data, ble_data_size);
			}
			else msg.text = "Wrong format";
		} 
		else if (u.message().text().startsWith(PIN_GEN)) {
			uint32_t pin = generate_pin(u.message().text().str() + sizeof(PIN_PASS_SET)//-1
			,u.message().text().length(), pin_pass);
			msg.text = pin;
		} 
		 else if (u.message().text().startsWith(PIN_PASS_SET)) {
			if(u.message().text().length() > sizeof(PIN_PASS_SET) + 42) { msg.text = "too much size";} 
			else {
				pin_pass = u.message().text().str() + sizeof(PIN_PASS_SET); //with space
				msg.text = "password changed to: ";  msg.text += pin_pass;//sizeof(Text) 
				msg.text += '\n'; msg.text += "pin_pass_len = "; msg.text += pin_pass.length();
			}
		} 
		else*/ { msg.text = "Unknown"; }
	}
#else 
	default: {
#ifdef CONFIG_GENERIC_LINE
		if(update_adc_sets(u.message().text()._str, msg.text)) break;
#endif
		msg.text = "Unknown";
	}
	}
#endif
	DEBUGLN(msg.text);
	bot.sendMessage(msg);
}

