sQueezy1332/esp32_proxima_pir_tgbot/main.cpp
void handleDocument(fb::Update& u) {
	switch (u.message()[tg_apih::caption].hash()) {
	case SH("/fw"): otaBegin(u, &Fetcher::updateFlash); break;
	case SH("/filesystem"): otaBegin(u, &Fetcher::updateFS); break;
	default: bot.sendMessage(Message("Unknown", u.message().chat().id()));
	}
}

void otaBegin(fb::Update& u, bool(Fetcher::*updater)()) {
	AutoLed<PIN_LED> led; 
	vTaskSuspend(sendTaskHandle); vTaskSuspend(adcTaskHandle); 
	bool temp = sets.alarm; if(temp) alarm_off(false);esp_ota_get_next_update_partition(NULL);
	const esp_partition_t *part = esp_ota_get_next_update_partition(NULL);
	Message msg("OTA begin\nPartition: ", u.message().chat().id());
	msg.text += part->label; msg.text += "\nsize: "; msg.text += part->size;
	bot.sendMessage(msg);
	Fetcher fetch = bot.downloadFile(u.message().document().id());
	if (fetch) {
		if ((fetch.*updater)()) { msg.text = "Success\nRestarting..."; Flag = RESTART; }
		else { msg.text = "Error = "; msg.text += Update.getError();msg.text += '\n';
			msg.text += "esp_err = 0x"; msg.text += String(update_error, HEX); update_error = 0;} 
	}
	else { msg.text = "Download error"; }
	ESP_LOGI(FUN, msg.text.c_str());
	bot.sendMessage(msg);
	if(temp) alarm_on(false); 
	vTaskResume(sendTaskHandle); vTaskResume(adcTaskHandle);
	ESP_LOGD(FUN, "StackHighWaterMark: %u", uxTaskGetStackHighWaterMark2(NULL));
}

void updateHandler(fb::Update& u) {
	if (u.isMessage() && u.message().from().id() == USER_ID) {
		if (Flag > CHECK_MSG) Flag = CHECK_MSG;
		if (u.message().hasDocument() && u.message().document().name().endsWith(".bin"))
			handleDocument(u);
		else handleMessage(u);
	}
}

void wifi_server_init() {
	/* __weak_symbol  */extern AsyncWebServer server;
	server.onNotFound([](AsyncWebServerRequest* request) {
		DEBUGLN("[" + request->client()->remoteIP().toString() + "] HTTP GET request of " + request->url());
		request->send(404, "text/plain", "Not found");
		});
	server.on("/connect", HTTP_GET, [](AsyncWebServerRequest* request) { String str;
		if(Auth) { str = "Connecting to:\n"; str += "SSID = ["; str += (Auth->ssid); str += "]\n"; str += "PASS = ["; str += Auth->pass; str += "]\n";
			resumeTask(WIFI_INIT); }
		else { str = "Auth empty"; } 
		request->send(200, "text/plain", str); 
		});
	server.on("/disconnect", HTTP_GET, [](AsyncWebServerRequest* request) {
		request->send(200, "text/plain", "Disconnecting..."); resumeTask(WIFI_DISCONNECT);
		});
	server.on("/restart", HTTP_GET, [](AsyncWebServerRequest* request) {
		request->send(200, "text/plain", "Esp restarting...");
		resumeTask(RESTART);
		});
	server.on("/alarm_on", HTTP_GET, [](AsyncWebServerRequest* request) {
		request->send(200, "text/plain", "Alarm on"); alarm_on();
		});
	server.on("/alarm_off", HTTP_GET, [](AsyncWebServerRequest* request) {
		request->send(200, "text/plain", "Alarm off"); alarm_off();
		});
	server.on(CHANGE_AUTH, HTTP_GET, [](AsyncWebServerRequest* request) {
		auto response = request->beginResponse(SPIFFS, CHANGE_FAILE_PATH, "text/html");
		response->addHeader(asyncsrv::T_Content_Encoding, "gzip");
		request->send(response);
		});
	server.on(CHANGE_AUTH, HTTP_POST, onConfigRequest);
#if defined RELAY
	server.on(RELAY_ON, HTTP_GET, [](AsyncWebServerRequest* request) {
		const int new_state = !dRead(PIN_RELAY); sets.relay = RELAY_STATE(new_state);
		dWrite(PIN_RELAY, new_state);
		request->send(200, "text/plain", RELAY_STATE(new_state) ? "RELAY ON" : "RELAY OFF");
		});
#endif
	ota::server_init(server
#ifdef DEBUG_ENABLE
		, ota_progress
#endif // DEBUG_ENABLE
	);
	server.begin(); log_v("server.begin()");
}
/*		BLUETOOTH		*/
#ifndef NO_BLE
esp_err_t ble_advertising(cbyte* ble_data, cbyte ble_data_length, uint32_t time_ms) {
	if (ble_data == nullptr || ble_data_length == 0) return -1; log_d("%u", ESP.getFreeHeap());
	return ESP_OK;
}
#endif
/*		MISC		*/

bool update_adc_sets(cch* data,  String& text) {
	if(!strncmp(data,"/mode_", sizeof("/mode_")-1)) {
		data += sizeof("/mode_")-1;
		byte proxima = 0xFF, adc = 0xFF;
		if(data[0] == '1') { proxima = 1;}
		else if(data[0] == '0') { proxima = 0; } 
		if(data[1] == '1') { adc = 1; }
		else if(data[1] == '0') { adc = 0; } 
		if(proxima == 0xFF || adc == 0xFF) {
			goto error;
		} else {
			text = "Proxima "; text += proxima ? "ON": "OFF";
			text += "\nADC_Line "; text += adc ? "ON": "OFF";
			sets.proxima = proxima, sets.adc_line = adc;
			nvs_write_sets();
			init_sets(); //return true;
		};
	} 
	else if(!strncmp(data,"/gerkon_", sizeof("/gerkon_")-1)) {
		unsigned res; data += sizeof("/gerkon_")-1;
		if(!strncmp(data, "open_", sizeof("open_")-1)) {
			data += sizeof("open_")-1;
			if((res = atoi(data)) > 0 && res < 4095) {
				gerkon_open_def = res;
				text = "gerkon_open_def = "; text += res;
			} else goto error;
		}
		else if(!strncmp(data, "close_", sizeof("close_")-1)) {
			data += sizeof("close_")-1;
			if((res = atoi(data)) > 0 && res < 4095) {
				gerkon_close_def = res;
				text = "gerkon_close_def = "; text += res;
			} else goto error;
		} else if(!strncmp(data, "button_", sizeof("button_")-1)) {
			data += sizeof("button_")-1;
			if((res = atoi(data)) > 0 && res < 4095) {
				gerkon_button_def = res;
				text = "gerkon_button_def = "; 
			} else goto error;
		} else if(!strncmp(data, "percent_", sizeof("percent_")-1)) {
			data += sizeof("percent_")-1;
			if((res = atoi(data)) > 0 && res < 30) {
				gerkon_percent_drift = res;
				text = "gerkon_percent_drift = "; 
			} else goto error;
		} else return false;
		ESP_LOGI(TAG, "%u", res);
		text += res;
		init_adc_values(); //return true;
	} else { return false; }
	return true;
error: text = "WRONG INPUT"; return true;
}

void read_credentials() {
	wifi_config_t config {};  size_t ssid_l, pass_l;
	esp_wifi_get_config(WIFI_IF_STA, &config);log_d("%s\tpass: %s", config.sta.ssid,config.sta.password);
	ssid_l = strlen((char*)config.sta.ssid); pass_l = strlen((char*)config.sta.password);
	//for (size_t i = 0; i < 16; i++) putchar((config.sta.ssid)[i]);
	//for (size_t i = 0; i < 16; i++) putchar((config.sta.password)[i]);
	if (ssid_l < 1 || pass_l < 8) {
		log_w("ssid len %u, pass len %u", ssid_l, pass_l);
  		config.sta.threshold.rssi = -127;
		memcpy(config.sta.ssid, DEFAULT_SSID, sizeof(DEFAULT_SSID));
		memcpy(config.sta.password, DEFAULT_PASS, sizeof(DEFAULT_PASS));
		esp_wifi_set_config(WIFI_IF_STA, &config);
	}
}

void nvs_read_sets() {
	nvsApi nvs;
    if(nvs.begin(NVS_WIFI_SPACE, NVS_READWRITE) == ESP_OK) {
        auto ret = nvs_get_u32(nvs, NVS_KEY, reinterpret_cast<uint32_t*>(&sets)); //reinterpret_cast<uint32_t*>(&sets)
        if (ret == ESP_OK) {
            //if (crc8_le(0, (byte*)&sets, 3) == sets.crc) {
				ESP_LOGI(FUN, "Alarm %u, relay %u, proxima  %u, adc_line %u", 
					sets.alarm, sets.relay, sets.proxima, sets.adc_line);
	            //sets.alarm ? alarm_on(false) : alarm_off(false);
                return;
            //} else { ESP_LOGW(TAG, "sets.crc = 0x%02X", sets.crc); };
        } else { CHECK_(ret); }
    }
	sets.alarm = 1; sets.proxima = 1, sets.adc_line = 1;//alarm_on(false);
	nvs_write_sets(nvs);
}

