sQueezy1332/esp32_proxima_pir_tgbot/main.cpp
void nvs_write_sets(nvsApi nvs) {
	//sets.crc = crc8_le(0, (byte*)&sets, 3); log_d("%u, %02X", sets.alarm, sets.crc);
    esp_err_t ret = nvs_set_u32(nvs, NVS_KEY, reinterpret_cast<uint32_t&>(sets));
	if(ret == ESP_OK) { ret = nvs_commit(nvs); return; };
    CHECK_(ret);
}

void get_task_list(String& str) {
	auto num = uxTaskGetNumberOfTasks(); ESP_LOGD(TAG,"GetNumberOfTasks = %u", num);
	if (!str.reserve(num * 35)) return;
	char* const ptr = str.begin();
	vTaskList(ptr);
	reinterpret_cast<uint32_t*>(&str)[2] = strlen(ptr);
}

String get_info(bool ver) {
	uint32_t heap = ESP.getFreeHeap(); uint32_t sec = uS / 1000000;
	String str; str.reserve(400);
	str += "Connected to: "; str += WiFi.SSID(); str += "\nLocal IP: "; str += WiFi.localIP().toString(); str += "\nRSSI: "; str += WiFi.RSSI();
	str += "\nFree Heap: "; str += heap; str += "\nStack watermark:"; 
	str += "\nmain "; str += uxTaskGetStackHighWaterMark2(loopTaskHandle);
	str += "\nsend "; str += uxTaskGetStackHighWaterMark2(sendTaskHandle);
#ifdef CONFIG_GENERIC_LINE
	if(adcTaskHandle) {str += "\nadc "; str += uxTaskGetStackHighWaterMark2(adcTaskHandle);}
	if(curr_adc_ptr) { 
	str += "\nADC value "; str +=  *curr_adc_ptr;
	str += "\ngerkon_open_high = "; str += gerkon_open_high;
	str += "\ngerkon_close_high = "; str += gerkon_close_high;
	str += "\ngerkon_close_low = ";  str += gerkon_close_low;
	str += "\ngerkon_button_low = ";  str += gerkon_button_low;
	str += "\ngerkon_percent_drift = ";  str += gerkon_percent_drift;
	}
#endif
	//str += "\ninterrupt_delta =  "; str += interrupt_delta;
	//sets.relay = RELAY_STATE(dRead(PIN_RELAY));
	//str += "\nSettings 0x"; str += String(reinterpret_cast<uint32_t&>(sets), HEX);
	str += "\nSettings:\nalarm "; str += sets.alarm, str += "; proxima "; 
	str += sets.proxima; str += "; adc_line "; str += sets.adc_line; str += ";relay "; str += sets.relay;
	//str += "\nMode_";  str += sets.alarm; str += sets.proxima; str += sets.adc_line, str += sets.relay;
	if(sets.proxima/* last_interrupt != 0xFFFFFF */) { str += "\nlast_interrupt: "; str += last_interrupt; }
	str += "\nUptime: "; str += sec / 3600 / 24;  str += "d "; str += sec / 3600 % 24; str += "h "; str += sec / 60 % 60; str += "m "; str += sec % 60; str += "s";
	str += "\nUnix time: "; str += (unsigned)time(NULL);//(timestamp_unix + ((uS - time_sync_unix) / 1000000ul));
	if (ver) {
		if (img_state(false) == ESP_OTA_IMG_PENDING_VERIFY) { str += "\nESP_OTA_IMG_PENDING_VERIFY"; }
		str += ("\nCompiled: " __TIMESTAMP__ "\n");
	} ESP_LOGD("get_info","%u", str.length());
	return str;
}

void init_sets() {
#ifdef CONFIG_PROXIMA_PIR
	if(sets.proxima && !timer_sab) {
		assert(timer_sab = timer_init(TIMER_SABOTAGE, sabotage_timer));
		assert(timer_intr = esp_timer_init([](void*) { enableInterrupt(PIN_LINE); } ));
		attachInterrupt(PIN_LINE, &isr_handler, GPIO_INTR_NEGEDGE);
	} else if(!sets.proxima && timer_sab) {
		Flag = RESTART;
		//detachInterrupt(PIN_LINE);
		//CHECK_(esp_timer_delete(timer_intr));
		//CHECK_(gptimer_stop(timer_sab));
		//CHECK_(gptimer_disable(timer_sab));
		//CHECK_(gptimer_del_timer(timer_sab));
		//timer_sab = NULL;
	}
#endif
#ifdef CONFIG_GENERIC_LINE
	if(sets.adc_line && !adc_handle) {
		init_adc_values();
		assert(xTaskCreate(adcReadTask, "adc", 2048, NULL, 2, &adcTaskHandle));
		adc_channel_t channel[] = { PIN_ADC_LINE }; int size = sizeof(channel)/sizeof(adc_channel_t);
		adc_handle = continuous_adc_init(conv_done_cb, channel, size, BUF_ADC_SIZE); 
		//ESP_ERROR_CHECK(adc_continuous_start(adc_handle));
		gpio_config_t conf = { BIT(PIN_ADC_LINE) | BIT(PIN_ADC_PULLUP) | BIT(PIN_ADC_PULLUP2), GPIO_MODE_INPUT, GPIO_PULLUP_ENABLE };
	    gpio_config(&conf);
		//vTaskResume(adcTaskHandle);
	}
	else if (!sets.adc_line && adc_handle) {
		Flag = RESTART;
		//vTaskSuspend(adcTaskHandle);
		//CHECK_(adc_continuous_stop(adc_handle)); //error
		//CHECK_(adc_continuous_deinit(adc_handle));
		//adc_handle = NULL;
	}
#endif
}

void alarm_on(bool write) {
#ifdef CONFIG_PROXIMA_PIR
	if(sets.proxima) {  enableInterrupt(PIN_LINE); timer_start_impl(); ESP_LOGI(TAG, "ALARM_ON"); }
#endif
#ifdef CONFIG_GENERIC_LINE
	if(sets.adc_line) { /* nothing */  } else {/* nothing */ }
#endif
#if defined CONFIG_GENERIC_LINE || defined CONFIG_GENERIC_LINE
	sets.alarm = 1;
	if (write) {  nvs_write_sets(); } 
#endif
}

void alarm_off(bool write) {
#ifdef CONFIG_PROXIMA_PIR
	if(sets.proxima) { 
		disableInterrupt(PIN_LINE); timer_stop_impl();  ESP_LOGI(TAG, "ALARM_OFF");
	}
#endif
#ifdef CONFIG_GENERIC_LINE
	if(sets.adc_line) { /* nothing */  } else {/* nothing */ }
#endif
#if defined CONFIG_GENERIC_LINE || defined CONFIG_GENERIC_LINE
	sets.alarm = 0;
	if (write) {  nvs_write_sets(); } 
#endif
}

void create_hex_string(String& str, cbyte* buf, cbyte data_size) {
	const size_t str_size = data_size * 3;
	if (!str.reserve(str_size)) return; //log_d("%u", str.isSSO());
	char* ptr = str.begin(); if(!ptr) { log_d("NULL"); return; }
	byte *field = reinterpret_cast<byte*>(&str) + (sizeof(String) -1); static_assert(sizeof(String) == 16);
	if(*field & 0x80) { *field = (str_size | 0x80); }// SSO
	else reinterpret_cast<uint32_t*>(&str)[2] = str_size;
	for (byte i = 0, shift, nibble, num;;*ptr++ = ' ') {
		for (shift = 4, num = buf[i];; shift = 0) {
			nibble = (num >> shift) & 0xF;
			*ptr++ = nibble < 10 ? nibble ^ 0x30 : nibble + ('A' - 10);
			if (shift == 0) break;
		} 
		if (++i >= data_size) break;
	}*ptr = '\0';
	log_d("str.length: %u, data_size: %u", str.length(), data_size);
}

bool strtoB(const String& str, byte*& buf, byte & data_size, byte sub, bool heap) { 
	size_t str_len = str.length() - sub, hex_len = (str_len + 1) / 2; log_d("hex_len = %u", hex_len);
	if (hex_len < 4 || hex_len > 255) return false;
	byte i = 0; cch* ptr = str.c_str() + sub;
	byte* _buf = (byte*)realloc(buf, hex_len); if (_buf == NULL) return false; buf = _buf;
        for (byte shift = 0, result = 0;; ++ptr) {
                switch (*ptr) {
                case '0'... '9':
                    result <<= shift;
                    result |= (*ptr ^ 0x30); break;
                case 'A'... 'F':
                    result <<= shift;
                    result |= *ptr - 55; break;
                case 'a' ...'f':
                    result <<= shift;
                    result |= *ptr - 87; break;
                case '\0': buf[i] = result; data_size = ++i;return true;
                default: if(!shift) continue;
                goto rdy;
            }
            if (shift) {
rdy:            buf[i] = result;
                if (++i >= hex_len) break;
                result = 0; shift = 0;
            } else { shift = 4;};
    }//
    data_size = i;
	return realloc(buf, i);
}

adc_continuous_handle_t continuous_adc_init(adc_continuous_callback_t cb, const adc_channel_t *channel, uint8_t channel_num, uint16_t buf_size) {
    adc_continuous_handle_t handle = NULL;
    adc_continuous_handle_cfg_t adc_config = {
        .max_store_buf_size = buf_size,
        .conv_frame_size = buf_size,//SOC_ADC_DIGI_DATA_BYTES_PER_CONV
    };
    ESP_ERROR_CHECK(adc_continuous_new_handle(&adc_config, &handle));
    adc_digi_pattern_config_t adc_pattern[SOC_ADC_PATT_LEN_MAX] = {};
    for (int i = 0; i < channel_num; i++) {
        adc_pattern[i].atten = ADC_ATTEN_DB_12;
        adc_pattern[i].channel = channel[i] & 0x7;
        adc_pattern[i].unit = ADC_UNIT_1;
        adc_pattern[i].bit_width = SOC_ADC_DIGI_MAX_BITWIDTH;
        ESP_LOGD(TAG, "adc_pattern[%d].atten is :%" PRIx8, i, adc_pattern[i].atten);
        ESP_LOGD(TAG, "adc_pattern[%d].channel is :%" PRIx8, i, adc_pattern[i].channel);
        ESP_LOGD(TAG, "adc_pattern[%d].unit is :%" PRIx8, i, adc_pattern[i].unit);
    }///*!< F_sample = F_digi_con / 2 / interval. F_digi_con = 5M for now. 30 <= interval <= 4095 */
    adc_continuous_config_t dig_cfg = {
		.pattern_num = channel_num,
        .adc_pattern = adc_pattern,
        .sample_freq_hz = SOC_ADC_SAMPLE_FREQ_THRES_LOW,
        .conv_mode = ADC_CONV_SINGLE_UNIT_1,
        .format = ADC_OUTPUT_TYPE,
    };
    ESP_ERROR_CHECK(adc_continuous_config(handle, &dig_cfg));
    if(cb) {
        adc_continuous_evt_cbs_t cbs = { .on_conv_done = cb};
        ESP_ERROR_CHECK(adc_continuous_register_event_callbacks(handle, &cbs, NULL));
    }
    ESP_ERROR_CHECK(adc_continuous_start(handle));
    return handle;
}

